<a href="https://colab.research.google.com/github/byhqsr/CodeRepo/blob/main/Feature_Engineering_ICoDSA_2021_Louis_Owen.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Author: [Louis Owen](https://louisowen6.github.io/)

Download this [data](https://drive.google.com/file/d/17gHvgAEcpy7NjUHRU9Ott18pYdCeLveQ/view) and try to perform the exact feature engineering in the previous study case. 

Note: no need to worry about `is_cross_sell` column in this dataset.

# Connect to Google Drive

In [ ]:
from google.colab import drive
drive.mount('/content/gdrive')

Mounted at /content/gdrive

In [ ]:
%cd /content/gdrive/MyDrive/Public Speaker/ICoDSA 2021

/content/gdrive/MyDrive/Public Speaker/ICoDSA 2021

# Import Package

In [ ]:
import pandas as pd
import numpy as np

# Import Data

In [ ]:
df = pd.read_csv('test.csv')

# Initial EDA

In [ ]:
df.sample(5)

                            account_id  ...                                    log_transaction
4465  ec224f599d4a1a97dbd0a577ef5f2223  ...  '[8650708.83, 2476530.38, 5745383.85, 4065126.0]'
6827  8fde94e9aab1312a33ee0ccf8b08e16a  ...  '[1082500.74, 4673968.76, 2146519.7, 2060115.07]'
1578  db792894853c7094dd28353d2e09c68f  ...                          '[6941346.35, 4148612.0]'
653   fa1f8da3294f672fd3acc0dc15b02a65  ...  '[9814253.54, 3263390.0, 3263390.0, 1631695.0,...
5344  edf1b92660089f63bf316d7c0525f08c  ...              '[9117984.91, 2470066.57, 1465230.0]'

[5 rows x 13 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   account_id            10000 non-null  object
 1   order_id              10000 non-null  object
 2   member_duration_days  10000 non-null  int64
 3   gender                10000 non-null  object
 4   trip                  10000 non-null  object
 5   service_class         10000 non-null  object
 6   price                 10000 non-null  float64
 7   is_tx_promo           10000 non-null  object
 8   no_of_seats           10000 non-null  int64
 9   airlines_name         10000 non-null  object
 10  route                 10000 non-null  object
 11  visited_city          10000 non-null  object
 12  log_transaction       10000 non-null  object
dtypes: float64(1), int64(2), object(10)
memory usage: 1015.8+ KB

# Feature Engineering

## Construct Aggregation Statistics Features from Log Transaction

In [ ]:
from ast import literal_eval

def extract_log_trx_stats(log_series):
    # Dictionary to save the statistics value for each rows
    log_trx_stats_dict = {'min_trx':[],'max_trx':[],
                          'avg_trx':[],'std_trx':[],'cnt_trx':[]}

    for i in range(len(log_series)): # Lopping through each rows
        # Convert from string of list to list
        trx_list = literal_eval(literal_eval(log_series.iloc[i]))

        # Extract Aggreation Statistics
        log_trx_stats_dict['min_trx'].append(np.min(trx_list))
        log_trx_stats_dict['max_trx'].append(np.max(trx_list))
        log_trx_stats_dict['avg_trx'].append(np.mean(trx_list))
        log_trx_stats_dict['std_trx'].append(np.std(trx_list))
        log_trx_stats_dict['cnt_trx'].append(len(trx_list))

    return pd.DataFrame(log_trx_stats_dict)

In [ ]:
df = pd.concat([df,extract_log_trx_stats(df['log_transaction'])],axis=1)

In [ ]:
df

                            account_id  ... cnt_trx
0     89a5fadd4d596610ff56044b9a0b1f4f  ...       6
1     86b28323bec6d938d47cee887e509b28  ...       4
2     36ef956ac3ef963c48e67327a4b6cc78  ...       6
3     f7821289404d44db50eb2edd4f82ea5b  ...       3
4     f62f33d1de5aabc919b69b1b5697f27a  ...       3
...                                ...  ...     ...
9995  998d43683c1ba7a49e1ac8392b738271  ...       5
9996  baead48bd98db56344745902906c1f08  ...       9
9997  6b280411d8c49c5572e0499eaebdac18  ...       6
9998  716c79a0238b8aa7da0089d6ba2c70b2  ...       3
9999  c5b7abd59b0e49d8c70638e4d9effc9a  ...       6

[10000 rows x 18 columns]

## Construct Is Visited City Features

In [ ]:
df['visited_jogja'] = df['visited_city'].apply(lambda x: 1 if 'Jogjakarta' in x else 0)
df['visited_semarang'] = df['visited_city'].apply(lambda x: 1 if 'Semarang' in x else 0)
df['visited_surabaya'] = df['visited_city'].apply(lambda x: 1 if 'Surabaya' in x else 0)
df['visited_aceh'] = df['visited_city'].apply(lambda x: 1 if 'Aceh' in x else 0)
df['visited_manado'] = df['visited_city'].apply(lambda x: 1 if 'Manado' in x else 0)

In [ ]:
df

                            account_id  ... visited_manado
0     89a5fadd4d596610ff56044b9a0b1f4f  ...              0
1     86b28323bec6d938d47cee887e509b28  ...              0
2     36ef956ac3ef963c48e67327a4b6cc78  ...              0
3     f7821289404d44db50eb2edd4f82ea5b  ...              0
4     f62f33d1de5aabc919b69b1b5697f27a  ...              0
...                                ...  ...            ...
9995  998d43683c1ba7a49e1ac8392b738271  ...              0
9996  baead48bd98db56344745902906c1f08  ...              0
9997  6b280411d8c49c5572e0499eaebdac18  ...              0
9998  716c79a0238b8aa7da0089d6ba2c70b2  ...              0
9999  c5b7abd59b0e49d8c70638e4d9effc9a  ...              0

[10000 rows x 23 columns]

## Encode Airlines Name

In [ ]:
df['airlines_name'].unique()

array(['e35de6a36d385711a660c72c0286154a',
       'ad5bef60d81ea077018f4d50b813153a',
       '33199710eb822fbcfd0dc793f4788d30',
       '74c5549aa99d55280a896ea50068a211',
       '0a102015e48c1f68e121acc99fca9a05',
       '6c483c0812c96f8ec43bb0ff76eaf716'], dtype=object)

In [ ]:
airlines_name_dict = {'e35de6a36d385711a660c72c0286154a':'A',
                      'ad5bef60d81ea077018f4d50b813153a': 'B',
                      '33199710eb822fbcfd0dc793f4788d30': 'C',
                      '74c5549aa99d55280a896ea50068a211': 'D',
                      '0a102015e48c1f68e121acc99fca9a05': 'E',
                      '6c483c0812c96f8ec43bb0ff76eaf716': 'F',
                      }

In [ ]:
df['airlines_name'] = df['airlines_name'].map(airlines_name_dict)

In [ ]:
df

                            account_id  ... visited_manado
0     89a5fadd4d596610ff56044b9a0b1f4f  ...              0
1     86b28323bec6d938d47cee887e509b28  ...              0
2     36ef956ac3ef963c48e67327a4b6cc78  ...              0
3     f7821289404d44db50eb2edd4f82ea5b  ...              0
4     f62f33d1de5aabc919b69b1b5697f27a  ...              0
...                                ...  ...            ...
9995  998d43683c1ba7a49e1ac8392b738271  ...              0
9996  baead48bd98db56344745902906c1f08  ...              0
9997  6b280411d8c49c5572e0499eaebdac18  ...              0
9998  716c79a0238b8aa7da0089d6ba2c70b2  ...              0
9999  c5b7abd59b0e49d8c70638e4d9effc9a  ...              0

[10000 rows x 23 columns]

# Drop Columns

In [ ]:
df = df.drop(columns=['account_id','order_id','route','visited_city','log_transaction'])

# Final Version

In [ ]:
df

      member_duration_days gender  ... visited_aceh visited_manado
0                     1754      M  ...            0              0
1                     1084      F  ...            0              0
2                     2378      M  ...            0              0
3                      576      F  ...            0              0
4                      862      F  ...            0              0
...                    ...    ...  ...          ...            ...
9995                   509      M  ...            0              0
9996                  2146      M  ...            0              0
9997                  1732      M  ...            0              0
9998                   734      F  ...            0              0
9999                   615      M  ...            0              0

[10000 rows x 18 columns]